416c616e/Remora-STM32H7xx-PIO/Src/remora/modules/stepgen/stepgen.cpp
#include "stepgen.h"
#include <STM32H7_SPIComms.h>


std::shared_ptr<Module> Stepgen::create(const JsonObject& config, Remora* instance)
	{
	    const char* comment = config["Comment"];
	    uint32_t threadFreq = config["ThreadFreq"];

	    printf("%s\n\r", comment);

	    int joint = config["Joint Number"];
	    const char* enable = config["Enable Pin"];
        bool enableInvert = (strcmp(config["Enable Pin Invert"], "on") == 0);
	    const char* step = config["Step Pin"];
	    const char* dir = config["Direction Pin"];

        bool debug = (strcmp(config["Debug"], "on") == 0);
        uint32_t debugFreq = config["DebugFreq"];

	    // Configure pointers to data source and feedback location
	    volatile int32_t* ptrJointFreqCmd = &instance->getRxData()->jointFreqCmd[joint];
	    volatile int32_t* ptrJointFeedback = &instance->getTxData()->jointFeedback[joint];
	    volatile uint8_t* ptrJointEnable = &instance->getRxData()->jointEnable;

	    bool usesModulePost = true;		// stepgen uses the thread modulesPost vector

	    // Create the step generator and register it in the thread
	    return std::make_unique<Stepgen>(threadFreq, joint, enable, enableInvert, step, dir, Config::stepBit, *ptrJointFreqCmd, *ptrJointFeedback, *ptrJointEnable, usesModulePost, debug, debugFreq, instance);
	}

/**
 * @brief Constructor for the Stepgen class.
 * 
 * Initializes the step generator with the provided configuration parameters
 * and allocates the necessary pins for the step, direction, and enable signals.
 * 
 * @param _threadFreq The thread frequency used for scaling the frequency command.
 * @param _jointNumber The joint number for which the step generator is configured.
 * @param _enable The name of the pin used to enable the step generator.
 * @param _enableInvert Invert the enable behavior of the enable pin
 * @param _step The name of the pin used for stepping.
 * @param _direction The name of the pin used for direction.
 * @param _stepBit The number of bits used for the step value.
 * @param _ptrFrequencyCommand A reference to the frequency command data for the joint.
 * @param _ptrFeedback A reference to the feedback data for the joint.
 * @param _ptrJointEnable A reference to the joint enable data.
 * @param _debug Enable debugging for the joint
 * @param _debugFreq Debugging thread frequency for outputting
 * @param _instance Remora pointer
 */
Stepgen::Stepgen(int32_t _threadFreq, int _jointNumber, const char* _enable, bool _enableInvert, const char* _step, const char* _direction, int _stepBit, volatile int32_t& _ptrFrequencyCommand, volatile int32_t& _ptrFeedback,  volatile uint8_t& _ptrJointEnable, bool _usesModulePost, bool _debug, uint32_t _debugFreq, Remora* _instance)
    : jointNumber(_jointNumber),
      enable(_enable),
      step(_step),
      direction(_direction),
      stepBit(_stepBit),
      ptrFrequencyCommand(&_ptrFrequencyCommand),
      ptrFeedback(&_ptrFeedback),
      ptrJointEnable(&_ptrJointEnable),
	  enablePin(_enable, OUTPUT, NONE),
      enableInvert(_enableInvert),
      stepPin(_step, OUTPUT, NONE),
      directionPin(_direction, OUTPUT, NONE),
      rawCount(0),
      DDSaccumulator(0),
      frequencyScale(1.0f * (1 << _stepBit) / _threadFreq),  // Frequency scaling without unnecessary cast
      mask(1 << _jointNumber),  // Mask for checking the joint number
      isEnabled(false),
      isForward(false),
      isStepping(false),
      debug(_debug),
      remora(_instance)
{
	usesModulePost = _usesModulePost;
    updateCount = _debugFreq;
}

/**
 * @brief Updates the Stepgen by generating pulses.
 * 
 * This method generates pulses for stepping according to the current
 * frequency command and direction.
 */
void Stepgen::update()
{
    makePulses();  // Generate pulses for stepping and direction
}

/**
 * @brief Post-update method for the Stepgen.
 * 
 * This method stops any ongoing pulses after the update phase.
 */
void Stepgen::updatePost()
{
    stopPulses();  // Stop pulse generation after update
}

/**
 * @brief Performs a slow update (no operation in this case).
 * 
 * This is a placeholder for performing any slow or low-priority updates,
 * though it currently does nothing.
 */
void Stepgen::slowUpdate()
{
    if (debug)
    {
        STM32H7_SPIComms* comms = (STM32H7_SPIComms*)this->remora->getCommsHandler()->getInterface();

        // Currently no operation for slow update
        printf("Joint %d - %s [Pin=%s, Dir=%s, Stepping=%s, Count=%d, Raw=%ld, Cmd=%d, DDSAV=%d, DDSACC=%d, Scale=%lf]\n\r", 
            this->jointNumber,
            this->isEnabled ? "ON" : "OFF",
            this->enablePin.get() ? "ON" : "OFF",
            this->isForward ? "FW" : "REV",
            this->isStepping ? "STEP" : "NO_STEP",
            this->rawCount,
            *ptrFeedback,
            *ptrFrequencyCommand,
            DDSaddValue,
            DDSaccumulator,
            frequencyScale
        );
    }
}

/**
 * @brief Generates pulses for step and direction.
 * 
 * This method calculates the next step and updates the step and direction
 * pins accordingly. It uses the DDS (Direct Digital Synthesis) technique
 * to generate precise frequency-based stepping.
 */
void Stepgen::makePulses()
{
    isEnabled = ((*(ptrJointEnable) & mask) != 0);
    if (!isEnabled)
    {
        enablePin.set(enableInvert ? true : false); // Disable the driver if not enabled
        return; // Exit early if the generator is disabled
    }

    enablePin.set(enableInvert ? false : true); // Enable the driver

    // Get the current frequency command and scale it using the frequency scale
    frequencyCommand = *ptrFrequencyCommand;
    DDSaddValue = frequencyCommand * frequencyScale;

    // Save the current DDS accumulator value and update it
    int32_t stepNow = DDSaccumulator;
    DDSaccumulator += DDSaddValue;

    // Check for changes in the low half of the DDS accumulator
    stepNow ^= DDSaccumulator;
    stepNow &= (1L << stepBit);  // Check for the step bit

    // Determine direction based on the sign of DDSaddValue
    isForward = DDSaddValue > 0;

    // If a step is to be made, set the direction and step pins accordingly
    if (stepNow)
    {
        directionPin.set(isForward);  // Set direction pin
        stepPin.set(true);  // Set the step pin
        rawCount += (isForward ? 1 : -1);  // Update rawCount based on direction
        *ptrFeedback = rawCount;  // Update the feedback with the raw count
        isStepping = true;  // Indicate that stepping is occurring
    }
}

/**
 * @brief Stops the pulse generation.
 * 
 * This method resets the step pin to low and stops any ongoing stepping.
 */
void Stepgen::stopPulses()
{
    stepPin.set(false);  // Reset step pin to low
    isStepping = false;  // Indicate that stepping has stopped
}

/**
 * @brief Enables or disables the Stepgen.
 * 
 * @param state The desired state of the Stepgen (true to enable, false to disable).
 */
void Stepgen::setEnabled(bool state)
{
    isEnabled = state;
}
